app/views/likes/_like.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
---
<%end%>
(<%= @post.likes.count%>)