app/controllers/api/v1/posts_controller.rb

  def index
    posts = Post.all.order("created_at DESC")
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESC