app/views/posts/show.html.erb

<h3>
  <% @post.tags.each do |tag|%>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = $1  [["post_id", 13]]

<hr>
<% @post.comments.each do |comment|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]