app/controllers/comments_controller.rb

  def create
    # @post = Post.find params[:post_id]
    comments_params = params.require(:comment).permit([:body])
    @comment = Comment.new comments_params
    @comment.post = @post
    @comment.user = current_user
    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "asdfdsafdsaf"], ["post_id", 1], ["user_id", 2], ["created_at", "2016-04-19 01:50:32.311864"], ["updated_at", "2016-04-19 01:50:32.311864"]]

  def destroy
    @post = Post.find params[:post_id]
    @comment = @post.comments.find params[:id]
    @comment.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["post_id", 1], ["id", 34]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 34]]

  def find_post
    @post = Post.find params[:post_id]
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]

  def find_comments
    @comment = @post.comments.find params[:id]
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]