app/controllers/likes_controller.rb

  def create
    @post = Post.find params[:post_id]
    like = Like.new
    like.post = @post
    like.user = current_user
    respond_to do |format|
        if like.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 1], ["user_id", 3], ["created_at", "2016-04-27 02:25:44.749408"], ["updated_at", "2016-04-27 02:25:44.749408"]]

  def destroy
    @post = Post.find params[:post_id]
    like = Like.find params[:id]
    like.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]