app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "saoidjfios"], ["body", "aosidjfosdjafjdosa"], ["user_id", 1], ["created_at", "2016-04-19 00:28:11.711875"], ["updated_at", "2016-04-19 00:28:11.711875"]]
---
  def create
    post_params = params.require(:post).permit([:title,:body,{tag_ids:[]}])
    @post = Post.new(post_params)
    @post.user = current_user
    if @post.save

SELECT "posts".* FROM "posts"  ORDER BY created_at DESC
---
  def index
    @posts = Post.all.order("created_at DESC")

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @post = Post.find params[:id]

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @post = Post.find params[:id]

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "first post edit"], ["updated_at", "2016-04-13 02:35:06.227317"], ["id", 1]]
---
  def update
    @post = Post.find params[:id]
    post_params = params.require(:post).permit([:title,:body,tag_ids:[]])
    if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 4]]
---
  def destroy
    @post = Post.find params[:id]
    @post.destroy

SELECT "posts".* FROM "posts"
---
  def find_post
    @post = Post.find params[:id]

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 11]]
---
  def find_owned_post
    @post = current_user.posts.find params[:id]