app/controllers/users_controller.rb

  def create
    user_params = params.require(:user).permit([:first_name,:last_name,:email,
      :password,:password_confirmation])
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def edit
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    user_params = params.require(:user).permit([:first_name,:last_name,:email])
    @user = User.find params[:id]
    if @user.update user_params
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "first_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["first_name", "test edited"], ["updated_at", "2016-04-19 16:04:47.556815"], ["id", 1]]

  def change_password
    @user = User.find params[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def change_password_update
    user_params = params.require(:user).permit([:password,:password_confirmation])
    old_password = params.require(:user).permit([:old_password])[:old_password]
    @user = User.find params[:user_id]
    # byebug

    #authenticate is to compate the () with the password_digest field
    if @user.authenticate(old_password)
      if @user.update user_params
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$hqi2ymlrmUYz4FMS7Vzcwuu7h8/l3xBREPvY62iTFne/hW4dyTME."], ["updated_at", "2016-04-20 01:17:26.885862"], ["id", 1]]